![Logo AceleraDev](https://github.com/codenation-dev/Data-Science-Online/blob/master/Semana%202/logo.png?raw=true)

# AceleraDev Data Science - Semana 2

## Eloisa Paz - Software Developer | Data Scientist Student

### Manipulando dados

- Importando os pacotes

In [4]:
import pandas as pd
import numpy as np

- Acessando o help dos pacotes

In [5]:
pd?

#### Dicionários

- Criando um dicionário com os dados

In [6]:
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300 ]}

- Para printar o dicionáario

In [7]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

- Verificando o tipo do dicionário

In [8]:
type(dados)

dict

- Acessando as chaves do meu dicionário

In [9]:
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

- Acessando uma chave específica

In [10]:
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

- Acessando uma posição específica de um dicionário

In [11]:
dados['acessos'][2]

300

In [12]:
dados['canal_venda'][2]

'instagram'

In [13]:
dados['canal_venda'][:3]

['facebook', 'twitter', 'instagram']

#### Listas

In [14]:
type([1,2,3])

list

- Criando uma lista

In [15]:
lista = [200, 200 , 300 ,800, 200]

- Printando a lista

In [16]:
lista

[200, 200, 300, 800, 200]

- Vendo valores específicos

In [17]:
lista[1]

200

- Fatia da lista

In [18]:
lista[:3]

[200, 200, 300]

- Adicionando a lista ao dicionário

In [19]:
dados['lista'] = lista

In [20]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

#### DataFrames

- Criar um data frame a partir de um dicionário

In [21]:
dataframe = pd.DataFrame(dados)

- Acessando o dataframe

In [22]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

- Printando os primeiros casos do dataframe

In [23]:
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200

- Verificando o formato do dataframe

In [24]:
dataframe.shape

(5, 5)

- Verificando o índice do dataframe

In [25]:
dataframe.index

RangeIndex(start=0, stop=5, step=1)

- Verificando os tipos dos dados do dataframe

In [26]:
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

- Verificando se existem valores faltantes

In [27]:
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

- Somando número de casos faltantes

In [28]:
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

- Printando os nomes das colunas

In [29]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

- Acessando uma coluna específica

In [30]:
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

- Criando uma nova coluna

In [31]:
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [32]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [33]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

- Removendo colunas

Somente para visualização

In [34]:
dataframe.drop(columns = ['acessos','site', 'canal_venda'])

    vendas  lista  nova_coluna
0  1000.52    200            1
1  1052.34    200            2
2  2002.00    300            3
3  5000.00    800            4
4   300.00    200            5

In [35]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

Removendo do dataframe

In [60]:
dataframe.drop(columns = 'nova_coluna', inplace = True)

In [61]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

- Mostrando as colunas

In [62]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

- Acessando valores especificos

In [37]:
dataframe['acessos'][1]

200

- Acessando fatia de coluna específica

In [38]:
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [63]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

- Fatiando os dados usando o iloc (linhas | colunas)

In [40]:
dataframe.iloc[3:,4:]

   lista  nova_coluna
3    800            4
4    200            5

- Fatiar os dados usando o loc (indice)

In [64]:
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800

- Selecionando colunas específicas

In [42]:
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

- Passando os valores através de lista

In [43]:
filtro = ['canal_venda', 'acessos']
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

- Usando o metodo info()

In [44]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
 5   nova_coluna  5 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 368.0+ bytes

In [65]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

- Pivotando os dados (coluna)

In [67]:
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

site         site1  site2  site3
canal_venda
facebook     100.0    NaN  500.0
instagram      NaN  300.0    NaN
linkedin       NaN  400.0    NaN
twitter      200.0    NaN    NaN

In [66]:
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

In [68]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

- Completando os valores faltantes usando fillna e pivotando os dados (coluna)

In [69]:
aux= dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [70]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

- Mudando as colunas usando o comando melt

In [71]:
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

- Resetando o índice do dataframe

In [72]:
print(aux.columns)
aux = dataframe.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['index', 'canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [74]:
aux

   index canal_venda  acessos   site   vendas  lista
0      0    facebook      100  site1  1000.52    200
1      1     twitter      200  site1  1052.34    200
2      2   instagram      300  site2  2002.00    300
3      3    linkedin      400  site2  5000.00    800
4      4    facebook      500  site3   300.00    200

In [75]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [76]:
aux.reset_index()

   level_0  index canal_venda  acessos   site   vendas  lista
0        0      0    facebook      100  site1  1000.52    200
1        1      1     twitter      200  site1  1052.34    200
2        2      2   instagram      300  site2  2002.00    300
3        3      3    linkedin      400  site2  5000.00    800
4        4      4    facebook      500  site3   300.00    200

In [77]:
aux

   index canal_venda  acessos   site   vendas  lista
0      0    facebook      100  site1  1000.52    200
1      1     twitter      200  site1  1052.34    200
2      2   instagram      300  site2  2002.00    300
3      3    linkedin      400  site2  5000.00    800
4      4    facebook      500  site3   300.00    200

- Exemplo do comando melt

In [81]:
aux= dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)

In [82]:
aux

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

- Somando colunas do dataframe

In [87]:
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
dtype: object

- Somando as linhas do dataframe

In [88]:
dataframe.sum(axis = 1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [89]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

- Calculando a mediana das colunas numericas

In [91]:
print('Por linha: ',dataframe.median(axis= 1) )

Por linha:  0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64

In [92]:
print('Por coluna: ', dataframe.median())

Por coluna:  acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

- Calculando a media das colunas númericas

In [93]:
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

- Calculando o desvio padrão das colunas numericas

In [94]:
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

- Usando o comando describe que calcula estatisticas descritivas para colunas numericas

In [95]:
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

- Calculando a moda

In [96]:
dataframe.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1   300.00  200.0
1         NaN      200  site2  1000.52    NaN
2         NaN      300    NaN  1052.34    NaN
3         NaN      400    NaN  2002.00    NaN
4         NaN      500    NaN  5000.00    NaN

- Valor máximo por coluna

In [97]:
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
dtype: object

- Valor mínimo por coluna

In [98]:
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
dtype: object

- Printando o número de valores únicos

In [99]:
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

- Contando valores únicos de uma coluna

In [100]:
dataframe['canal_venda'].value_counts()

facebook     2
linkedin     1
twitter      1
instagram    1
Name: canal_venda, dtype: int64

- Valores únicos de uma coluna

In [101]:
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

- Usando o groupby com valores numericos

In [102]:
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [103]:
dataframe.groupby('canal_venda')['acessos'].median()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

- Usando o groupby com categoricos

In [104]:
dataframe.groupby('site')['canal_venda'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [105]:
dataframe.groupby('site')['canal_venda'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

- Usando o groupby com a função agg

In [106]:
dataframe.groupby('canal_venda').agg({'site': 'unique',
                                     'acessos': 'sum'})

                       site  acessos
canal_venda
facebook     [site1, site3]      600
instagram           [site2]      300
linkedin            [site2]      400
twitter             [site1]      200

- Correlações entre variáveis

In [107]:
dataframe.corr(method = 'spearman')

         acessos    vendas     lista
acessos  1.00000  0.000000  0.335410
vendas   0.00000  1.000000  0.894427
lista    0.33541  0.894427  1.000000

In [108]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

- Criando variáveis categoricas por fatia de variável numerica

In [109]:
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 2000, 8000), 
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [110]:
dataframe

  canal_venda  acessos   site   vendas  lista categoria_vendas
0    facebook      100  site1  1000.52    200         0 a 1500
1     twitter      200  site1  1052.34    200         0 a 1500
2   instagram      300  site2  2002.00    300      2000 a 8000
3    linkedin      400  site2  5000.00    800      2000 a 8000
4    facebook      500  site3   300.00    200         0 a 1500

- Criando variável categorica usando compressão de lista

In [111]:
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [112]:
dataframe

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

- Juntando dois dataframes

Criando o dataframe_2

In [113]:
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [114]:
dataframe_2

    site   suporte
0  site1    Carlos
1  site1    Carlos
2  site2     Maria
3  site2     Maria
4  site3  Ezequiel

- Realizando o merge

In [115]:
dataframe.merge(dataframe_2, on = 'site', how = 'left')

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,0 a 1500,maior_que_300,Ezequiel

- Salvando o dataframe como csv

In [116]:
dataframe.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)

- Lendo dados no formato csv

In [117]:
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [118]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

- Lendo dados no formato json

In [119]:
json = pd.read_json('https://pricing.us-east-1.amazonaws.com/offers/v1.0/aws/index.json')

In [120]:
json

,formatVersion,disclaimer,publicationDate,offers
A4B,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'A4B', 'versionIndexUrl': '/offe..."
AWSAmplify,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'AWSAmplify', 'versionIndexUrl':..."
AWSAppSync,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'AWSAppSync', 'versionIndexUrl':..."
AWSBackup,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'AWSBackup', 'versionIndexUrl': ..."
AWSBudgets,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'AWSBudgets', 'versionIndexUrl':..."
...,...,...,...,...
comprehendmedical,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'comprehendmedical', 'versionInd..."
datapipeline,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'datapipeline', 'versionIndexUrl..."
mobileanalytics,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'mobileanalytics', 'versionIndex..."
transcribe,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'transcribe', 'versionIndexUrl':..."
translate,v1.0,This pricing list is for informational purpose...,2020-06-24T19:33:59Z,"{'offerCode': 'translate', 'versionIndexUrl': ..."

In [121]:
json['offers'][99]

{'offerCode': 'AmazonKinesisVideo',
 'versionIndexUrl': '/offers/v1.0/aws/AmazonKinesisVideo/index.json',
 'currentVersionUrl': '/offers/v1.0/aws/AmazonKinesisVideo/current/index.json',
 'currentRegionIndexUrl': '/offers/v1.0/aws/AmazonKinesisVideo/current/region_index.json'}

In [122]:
json.reset_index(inplace = True)

In [123]:
json['index']

0                    A4B
1             AWSAmplify
2             AWSAppSync
3              AWSBackup
4             AWSBudgets
             ...
149    comprehendmedical
150         datapipeline
151      mobileanalytics
152           transcribe
153            translate
Name: index, Length: 154, dtype: object